## pandas

In [3]:
import pandas as pd
import numpy as np
pd.__version__# to know the version of pandas

'2.0.3'

###pandas data structures

## pandas data structures

In [6]:
s=pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [10]:
df=pd.DataFrame({
    "name":["niha","mouni"],
    "age":[19,21]
})
df

    name  age
0   niha   19
1  mouni   21

## reading data from files

In [6]:
import pandas as pd
df=pd.read_csv(r"C:\Users\mouni\OneDrive\Desktop\loan_data.csv")
df

,Unnamed: 0,Gender,Married,Self_emp,Education,Applicant_Income,Dependents,Loan_Amt,Tenure,CoapplicantIncome,Credit_History,Approved
0,0,M,Yes,NaN,Grad,2600.0,0,115.0,NaN,3500.0,Yes,Y
1,1,M,Yes,0.0,Grad,5649.0,1,44.0,360.0,0.0,Yes,Y
2,2,M,Yes,0.0,Grad,3988.0,1,50.0,240.0,0.0,Yes,Y
3,3,M,Yes,1.0,Grad,3316.0,2,88.0,360.0,3500.0,Yes,Y
4,4,NaN,Yes,0.0,Grad,51763.0,3+,700.0,300.0,0.0,Yes,Y
...,...,...,...,...,...,...,...,...,...,...,...,...
115,37,M,Yes,0.0,NG,2492.0,1,NaN,360.0,0.0,No,Yes
116,38,M,Yes,0.0,G,3593.0,0,132.0,180.0,0.0,No,No
117,39,M,Yes,0.0,G,5923.0,0,211.0,360.0,0.0,No,Yes
118,40,NaN,NaN,NaN,NaN,NaN,NaN,46.0,NaN,0.0,No,NaN
119,41,NaN,NaN,NaN,NaN,NaN,NaN,480.0,NaN,0.0,No,NaN

In [2]:
df.to_csv('data.csv',index=False)

### exploring data

In [3]:
df.head()

,Unnamed: 0,Gender,Married,Self_emp,Education,Applicant_Income,Dependents,Loan_Amt,Tenure,CoapplicantIncome,Credit_History,Approved
0,0,M,Yes,NaN,Grad,2600.0,0,115.0,NaN,3500.0,Yes,Y
1,1,M,Yes,0.0,Grad,5649.0,1,44.0,360.0,0.0,Yes,Y
2,2,M,Yes,0.0,Grad,3988.0,1,50.0,240.0,0.0,Yes,Y
3,3,M,Yes,1.0,Grad,3316.0,2,88.0,360.0,3500.0,Yes,Y
4,4,NaN,Yes,0.0,Grad,51763.0,3+,700.0,300.0,0.0,Yes,Y

In [4]:
df.tail()

,Unnamed: 0,Gender,Married,Self_emp,Education,Applicant_Income,Dependents,Loan_Amt,Tenure,CoapplicantIncome,Credit_History,Approved
115,37,M,Yes,0.0,NG,2492.0,1,NaN,360.0,0.0,No,Yes
116,38,M,Yes,0.0,G,3593.0,0,132.0,180.0,0.0,No,No
117,39,M,Yes,0.0,G,5923.0,0,211.0,360.0,0.0,No,Yes
118,40,NaN,NaN,NaN,NaN,NaN,NaN,46.0,NaN,0.0,No,NaN
119,41,NaN,NaN,NaN,NaN,NaN,NaN,480.0,NaN,0.0,No,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         120 non-null    int64
 1   Gender             109 non-null    object
 2   Married            112 non-null    object
 3   Self_emp           107 non-null    float64
 4   Education          114 non-null    object
 5   Applicant_Income   114 non-null    float64
 6   Dependents         111 non-null    object
 7   Loan_Amt           113 non-null    float64
 8   Tenure             112 non-null    float64
 9   CoapplicantIncome  116 non-null    float64
 10  Credit_History     109 non-null    object
 11  Approved           114 non-null    object
dtypes: float64(5), int64(1), object(6)
memory usage: 11.4+ KB

In [6]:
df['Gender'][df['Married']=='Education']

Series([], Name: Gender, dtype: object)

In [7]:
df.shape

(120, 12)

In [8]:
df[2:5]

,Unnamed: 0,Gender,Married,Self_emp,Education,Applicant_Income,Dependents,Loan_Amt,Tenure,CoapplicantIncome,Credit_History,Approved
2,2,M,Yes,0.0,Grad,3988.0,1,50.0,240.0,0.0,Yes,Y
3,3,M,Yes,1.0,Grad,3316.0,2,88.0,360.0,3500.0,Yes,Y
4,4,NaN,Yes,0.0,Grad,51763.0,3+,700.0,300.0,0.0,Yes,Y

In [9]:
df.columns

Index(['Unnamed: 0', 'Gender', 'Married', 'Self_emp', 'Education',
       'Applicant_Income', 'Dependents', 'Loan_Amt', 'Tenure',
       'CoapplicantIncome', 'Credit_History', 'Approved'],
      dtype='object')

In [10]:
df.Gender

0        M
1        M
2        M
3        M
4      NaN
      ...
115      M
116      M
117      M
118    NaN
119    NaN
Name: Gender, Length: 120, dtype: object

In [11]:
df.Married

0      Yes
1      Yes
2      Yes
3      Yes
4      Yes
      ...
115    Yes
116    Yes
117    Yes
118    NaN
119    NaN
Name: Married, Length: 120, dtype: object

In [12]:
df.Education

0      Grad
1      Grad
2      Grad
3      Grad
4      Grad
       ...
115      NG
116       G
117       G
118     NaN
119     NaN
Name: Education, Length: 120, dtype: object

In [14]:
df[['Education','Loan_Amt']]

    Education  Loan_Amt
0        Grad     115.0
1        Grad      44.0
2        Grad      50.0
3        Grad      88.0
4        Grad     700.0
..        ...       ...
115        NG       NaN
116         G     132.0
117         G     211.0
118       NaN      46.0
119       NaN     480.0

[120 rows x 2 columns]

In [16]:
df['Loan_Amt'].min()

9.0

In [17]:
df['Loan_Amt'].max()

700.0

In [8]:
df['Loan_Amt'].describe()

count    113.000000
mean     163.743363
std      126.694147
min        9.000000
25%       99.000000
50%      126.000000
75%      185.000000
max      700.000000
Name: Loan_Amt, dtype: float64

In [7]:
df[df.Loan_Amt==df.Loan_Amt.max()]

,Unnamed: 0,Gender,Married,Self_emp,Education,Applicant_Income,Dependents,Loan_Amt,Tenure,CoapplicantIncome,Credit_History,Approved
4,4,NaN,Yes,0.0,Grad,51763.0,3+,700.0,300.0,0.0,Yes,Y
36,36,NaN,NaN,NaN,NaN,NaN,NaN,700.0,NaN,NaN,NaN,NaN

## missing avlues

In [9]:
df.isnull()

,Unnamed: 0,Gender,Married,Self_emp,Education,Applicant_Income,Dependents,Loan_Amt,Tenure,CoapplicantIncome,Credit_History,Approved
0,False,False,False,True,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,True,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
115,False,False,False,False,False,False,False,True,False,False,False,False
116,False,False,False,False,False,False,False,False,False,False,False,False
117,False,False,False,False,False,False,False,False,False,False,False,False
118,False,True,True,True,True,True,True,False,True,False,False,True
119,False,True,True,True,True,True,True,False,True,False,False,True

In [28]:
df=pd.DataFrame({
    "name":["sri","niharika","mouni"],
    "age":[23,24,None]
})
df

       name   age
0       sri  23.0
1  niharika  24.0
2     mouni   NaN

In [19]:
df.isnull().sum()

name    0
age     0
dtype: int64

In [22]:
df[df.isnull().any(axis=1)]

    name  age
2  mouni  NaN

In [25]:
df['age']=df['age'].fillna(df['age'].mean)
df

       name                                                age
0       sri                                               23.0
1  niharika                                               24.0
2     mouni  <bound method NDFrame._add_numeric_operations....

In [30]:
df_clean=df.dropna()

In [31]:
df_clean

       name   age
0       sri  23.0
1  niharika  24.0

## duplicates

In [40]:
df=pd.DataFrame({
    "name":["sri","niharika","sri"],
    "age":[23,34,23]
})
df

       name  age
0       sri   23
1  niharika   34
2       sri   23

In [41]:
df.duplicated()

0    False
1    False
2     True
dtype: bool

In [44]:
df[df.duplicated()]

  name  age
2  sri   23

In [45]:
df.drop_duplicates()

       name  age
0       sri   23
1  niharika   34

### summary statistics

In [5]:
import pandas as pd
df=pd.read_csv(r"C:\Users\mouni\Downloads\data.csv")
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,95
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97
2,J.Ramya,AIR,A,52,jivvireddyramyasri@gmailcom,9676976652,90
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90
6,Y.Kaveri,AIR,A,3,yendamurikaveri@gmail.com,7386015549,94
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,93

In [7]:
df['ROLLNO'].max()

58

In [8]:
df['ROLLNO'].min()

3

In [9]:
df['ROLLNO'].mean()

34.3

In [10]:
df['ROLLNO'].describe()

count    10.000000
mean     34.300000
std      18.475509
min       3.000000
25%      25.250000
50%      36.500000
75%      49.250000
max      58.000000
Name: ROLLNO, dtype: float64

In [11]:
df.count()

NAME                    10
CLASS                   10
SECTION                 10
ROLLNO                  10
               EMAIL    10
PHNO                    10
MARKS                   10
dtype: int64

In [12]:
df['MARKS'].nunique()

8

In [15]:
df.NAME[df.MARKS==df.MARKS.max()]

1    P.Devi
Name: NAME, dtype: object

In [18]:
df['MARKS'].value_counts()

MARKS
90    3
95    1
97    1
85    1
96    1
94    1
89    1
93    1
Name: count, dtype: int64

### String Cleaning

In [6]:
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,95
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97
2,J.Ramya,AIR,A,52,jivvireddyramyasri@gmailcom,9676976652,90
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90
6,Y.Kaveri,AIR,A,3,yendamurikaveri@gmail.com,7386015549,94
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,93

In [8]:
df["NAME"].str.lower()

0          b.yamuna
1            p.devi
2          j.ramya
3       k.prasanthi
4     k.v. niharika
5    k.sri niharika
6          y.kaveri
7           p.durga
8          p.akhila
9         p.neelima
Name: NAME, dtype: object

In [9]:
df["NAME"].str.upper()

0          B.YAMUNA
1            P.DEVI
2          J.RAMYA
3       K.PRASANTHI
4     K.V. NIHARIKA
5    K.SRI NIHARIKA
6          Y.KAVERI
7           P.DURGA
8          P.AKHILA
9         P.NEELIMA
Name: NAME, dtype: object

In [13]:
df["NAME"]=df["NAME"].str.replace("P.Devi","k.pooji")
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,95
1,k.pooji,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97
2,J.Ramya,AIR,A,52,jivvireddyramyasri@gmailcom,9676976652,90
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90
6,Y.Kaveri,AIR,A,3,yendamurikaveri@gmail.com,7386015549,94
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,93

### Concate Data Frames

In [15]:
india_weather=pd.DataFrame({
    "city":["kakinada","hyderabad","vizag"],
    "temparature":[32,45,35]
})
india_weather

        city  temparature
0   kakinada           32
1  hyderabad           45
2      vizag           35

In [24]:
US_weather=pd.DataFrame({
    "city":["newyork","Chicago","orland"],
    "temparature":[45,32,33]
})
US_weather

      city  temparature
0  newyork           45
1  Chicago           32
2   orland           33

In [20]:
df=pd.concat([india_weather,US_weather])
df

        city  temparature
0   kakinada           32
1  hyderabad           45
2      vizag           35
0    newyork           45
1    Chicago           32
2     orland           33

In [25]:
a=pd.concat([india_weather,US_weather],ignore_index=True)##ignore index=give the index line by line 012345
a

        city  temparature
0   kakinada           32
1  hyderabad           45
2      vizag           35
3    newyork           45
4    Chicago           32
5     orland           33

In [26]:
df=pd.concat([india_weather,US_weather],axis=1)##axis=1> it gives the index side by side
df

        city  temparature     city  temparature
0   kakinada           32  newyork           45
1  hyderabad           45  Chicago           32
2      vizag           35   orland           33

### merge data frames

In [35]:
temp_df=pd.DataFrame({
    "city":["hyd","mumbai","kkd","vizag"],
    "temparature":[32,43,29,30]
})
temp_df

     city  temparature
0     hyd           32
1  mumbai           43
2     kkd           29
3   vizag           30

In [36]:
humidity_df=pd.DataFrame({
    "city":["hyd","kirlampudi","prathipadu","vizag"],
    "humidity":[32,43,29,30]
})
humidity_df

         city  humidity
0         hyd        32
1  kirlampudi        43
2  prathipadu        29
3       vizag        30

In [37]:
df=pd.merge(temp_df,humidity_df,on="city")
df

    city  temparature  humidity
0    hyd           32        32
1  vizag           30        30

In [38]:
df=pd.merge(temp_df,humidity_df,how="outer")
df

         city  temparature  humidity
0         hyd         32.0      32.0
1      mumbai         43.0       NaN
2         kkd         29.0       NaN
3       vizag         30.0      30.0
4  kirlampudi          NaN      43.0
5  prathipadu          NaN      29.0

In [39]:
df.isnull()## to find the missing values or null values

    city  temparature  humidity
0  False        False     False
1  False        False      True
2  False        False      True
3  False        False     False
4  False         True     False
5  False         True     False

In [42]:
df.isnull().sum()

city           0
temparature    2
humidity       2
dtype: int64

In [45]:
df['temparature']=df['temparature'].fillna(df.temparature.min())

In [46]:
df.isnull()

    city  temparature  humidity
0  False        False     False
1  False        False      True
2  False        False      True
3  False        False     False
4  False        False     False
5  False        False     False

In [47]:
df

         city  temparature  humidity
0         hyd         32.0      32.0
1      mumbai         43.0       NaN
2         kkd         29.0       NaN
3       vizag         30.0      30.0
4  kirlampudi         29.0      43.0
5  prathipadu         29.0      29.0